backend/controllers/BrandController.php

SELECT * FROM `brand`
---
    public function actionIndex()
    {
        $models = Brand::find()->all();

INSERT INTO `brand` (`code`, `name`, `status`) VALUES ('Bailaing', 'Bailaing', 0)
---
    public function actionCreate()
    {
        $model = new Brand();

        if ($model->load(Yii::$app->request->post())) {
            $model->status = Brand::TT_MOI;
            if ($model->save()){