backend/controllers/CatProductsController.php

    public function actionCreate()
    {
        $model = new CatProducts();
        $dataCat = $model->getCat();
        if ($model->load(Yii::$app->request->post())) {
            $model->status = CatProducts::IS_NEW;
            if(!empty($model->avatar)){
                // convert base64 to image
                $data = $model->avatar;
                $fileName = explode('+', $data);
                $strFileNam = "$fileName[0]+";
                $img = explode($strFileNam, $data);
                $strEx = explode('base64,',$img[1]);
                $imgFile = base64_decode($strEx[1]);
                file_put_contents(Yii::$app->basePath.'/web/upload/cat-products/'.$fileName[0], $imgFile);
                $model->avatar = $fileName[0];
            }
            if ($model->save()){
---
INSERT INTO `cat_products` (`avatar`, `name`, `slug`, `parent_id`, `title_seo`, `description_seo`, `keyword_seo`, `status`) VALUES ('may-han-tien-dat.jpg', 'Máy Hàn Tiến Đạt', 'may-han-tien-dat', 17, '', '', '', 0)

    protected function findModel($id)
    {
        if (($model = CatProducts::findOne($id)) !== null) {
---
SELECT * FROM `cat_products` WHERE `id`='21'