backend/controllers/DetailCompanyController.php

    protected function findModel($id)
    {
        if (($model = DetailCompany::findOne($id)) !== null) {
---
SELECT * FROM `detail_company` WHERE `id`='1'