backend/controllers/OrderProductsController.php

SELECT * FROM `order_products`
---
    public function actionCreate(){
        $model = new OrderProducts();
        if ($model->load(Yii::$app->request->post())) {