backend/controllers/ProductsController.php

SELECT * FROM `cat_products` WHERE `id`='2'
SELECT * FROM `brand` WHERE `id`='1'
UPDATE `cat_products` SET `status`=1 WHERE `id`=66
---
                        $modelTags->save();
                    }
                }
                $modelCat = CatProducts::find()->where(['id' => $model->cat_id])->one();
                $modelBrand = Brand::find()->where(['id' => $model->brand])->one();
                if (!$modelCat->status == CatProducts::IS_ACTIVE) {
                    $modelCat->status = CatProducts::IS_ACTIVE;
                    $modelCat->save();