frontend/controllers/ProductsController.php

SELECT COUNT(*) FROM `products` WHERE (((`full_name` LIKE '%M%') OR (`code` LIKE '%M%')) OR (`price` LIKE '%M%')) OR (`slug` LIKE '%M%')
SELECT * FROM `products` WHERE (((`full_name` LIKE '%M%') OR (`code` LIKE '%M%')) OR (`price` LIKE '%M%')) OR (`slug` LIKE '%M%') LIMIT 25
---
    public function actionSearch($key){
        $query = Products::find()->where(['like', 'full_name', $key])
            ->orWhere(['like', 'code', $key])
            ->orWhere(['like', 'price', $key])
            ->orWhere(['like', 'slug', $key])
            ->andWhere(['status'=>Products::IS_ACTIVE]);
        if(!empty($query)){
            $countQuery = clone $query;
            $pages = new Pagination(['pageSize' => 24,'totalCount' => $countQuery->count()]);
            $models = $query->offset($pages->offset)
                ->limit($pages->limit)
                ->all();

SELECT * FROM `brand` WHERE `code`='Gomes'
SELECT * FROM `cat_products` WHERE `slug`='may-cat-nhom'
SELECT * FROM `cat_products` WHERE (`id`=68) OR (`parent_id`=68)
---
    public function actionListProductsCat($slug=null,$sort=null,$code = null,$priceToPrice= null){
        $brandName = Brand::find()->where(['code'=>$code])->one();
        $cat = CatProducts::find()->where(['slug'=>$slug])->one();

        $catId = CatProducts::find()->orWhere(['or',
        ['id'=>$cat->id],
        ['parent_id'=>$cat->id]
        ])->all();

SELECT * FROM `brand`
---
            ->limit($pages->limit)
            ->all();

        $brands = Brand::find()->all();