backend/views/products/_form.php

                    ?>
                </div>
                <div class="col-md-4">
                    <?= $form->field($model, 'brand')
                        ->dropDownList(
                            ArrayHelper::map(\common\models\Brand::find()->asArray()->all(), 'id', 'name'),['prompt'=>'--Lựa chọn thương hiệu--']
                        )
---
SELECT * FROM `brand`