backend/views/products/_search.php

            </div>
            <div class="col-md-2">
                <?php
                $cat=\common\models\CatProducts::find()->all();
---
SELECT * FROM `cat_products`