backend/views/layouts/page-sidebar.php

?>
<?php
$id = \Yii::$app->user->identity->id;
$user = \common\models\InfoProfile::find()->where(['user_id'=>$id])->one();
$frontend = \backend\assets\FrontendAsset::register($this);
?>
<?php
$model = \common\models\InfoProfile::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();
---
SELECT * FROM `info_profile` WHERE `user_id`=1