common/models/CatProducts.php

SELECT * FROM `cat_products` WHERE `parent_id` IS NULL
---
    public function getCat($parentId = null,$level="")
    {
        $result = CatProducts::find()->asArray()->where(['parent_id'=>$parentId])->all();