common/models/Products.php

SELECT * FROM `cat_products` WHERE `parent_id` IS NULL
---
    public function getCatProducts($parentId = null,$level="")
    {
        $result = CatProducts::find()->asArray()->where(['parent_id'=>$parentId])->all();