frontend/views/layouts/footer.php

<?php
use yii\helpers\Url;
$cats = \common\models\CatProducts::find()->where(['parent_id'=> null])->all();
---
SELECT * FROM `cat_products` WHERE `parent_id` IS NULL