frontend/views/layouts/header-top.php

</div>

<?php
$listCat = CatProducts::find()->where(['parent_id'=>null])->all();
---
SELECT * FROM `cat_products` WHERE `parent_id` IS NULL

                <a class="a-lv-1" href="<?= Url::to(['products/list-products-cat','slug'=>$menu->slug])?>"><?= ucwords($menu->name)?></a>
                <div class="menu-bar-lv-2">
                    <?php
                    $subMenus = CatProducts::find()->where(['parent_id'=>$menu->id])->all();
---
SELECT * FROM `cat_products` WHERE `parent_id`=2