frontend/views/layouts/header-bottom.php

SELECT * FROM `cat_products` WHERE `parent_id` IS NULL ORDER BY `sort`
---
<?php
use common\models\CatProducts;
use yii\helpers\Url;
$catProducts = CatProducts::find()->where(['parent_id'=>null])->orderBy(['sort'=>SORT_ASC])->all();

SELECT * FROM `cat_products` WHERE `parent_id`=2
---
                                <a href="<?= Url::to(['products/list-products-cat','slug'=>$catProduct->slug])?>" rel="category tag"><?= ucwords($catProduct->name) ?></a>
                                <ul class="sub-menu" style="min-height: 400px;">
                                    <?php
                                    $catProductParents = CatProducts::find()->where(['parent_id'=>$catProduct->id])->all();