backend/views/cat-products/index.php

SELECT * FROM `cat_products` WHERE `id` IS NULL
---
                    [
                        'attribute'=>'parent_id',
                        'value'=>function($data){
                            $name = \common\models\CatProducts::find()->where(['id'=>$data->parent_id])->one();